<!-- 1 -->
<h2>1.Сделайте функцию, которая принимает строку на русском языке, а возвращает ее транслит.</h2>
<?php
function rus2translit( $string ) {
	$converter = array(
		'а' => 'a',
		'б' => 'b',
		'в' => 'v',
		'г' => 'g',
		'д' => 'd',
		'е' => 'e',
		'ё' => 'e',
		'ж' => 'zh',
		'з' => 'z',
		'и' => 'i',
		'й' => 'y',
		'к' => 'k',
		'л' => 'l',
		'м' => 'm',
		'н' => 'n',
		'о' => 'o',
		'п' => 'p',
		'р' => 'r',
		'с' => 's',
		'т' => 't',
		'у' => 'u',
		'ф' => 'f',
		'х' => 'h',
		'ц' => 'c',
		'ч' => 'ch',
		'ш' => 'sh',
		'щ' => 'sch',
		'ь' => '\'',
		'ы' => 'y',
		'ъ' => '\'',
		'э' => 'e',
		'ю' => 'yu',
		'я' => 'ya',

		'А' => 'A',
		'Б' => 'B',
		'В' => 'V',
		'Г' => 'G',
		'Д' => 'D',
		'Е' => 'E',
		'Ё' => 'E',
		'Ж' => 'Zh',
		'З' => 'Z',
		'И' => 'I',
		'Й' => 'Y',
		'К' => 'K',
		'Л' => 'L',
		'М' => 'M',
		'Н' => 'N',
		'О' => 'O',
		'П' => 'P',
		'Р' => 'R',
		'С' => 'S',
		'Т' => 'T',
		'У' => 'U',
		'Ф' => 'F',
		'Х' => 'H',
		'Ц' => 'C',
		'Ч' => 'Ch',
		'Ш' => 'Sh',
		'Щ' => 'Sch',
		'Ь' => '\'',
		'Ы' => 'Y',
		'Ъ' => '\'',
		'Э' => 'E',
		'Ю' => 'Yu',
		'Я' => 'Ya',
	);

	return strtr( $string, $converter );
}

function str2url( $str ) {
	$str = rus2translit( $str );

	return $str;
}

echo str2url( 'кусок' );
?>

<!-- 2 -->
<h2>2.Сделайте функцию, которая возвращает множественное или единственное число существительного.
Пример: 1 яблоко, 2 (3, 4) яблока, 5 яблок. Функция первым параметром принимает число, 
а следующие 3 параметра — форма для единственного числа, для чисел два, три, четыре и для чисел,
больших четырех, например, func(3, 'яблоко', 'яблока', 'яблок').</h2>
<?php
function nz_todo2( $num, $str1, $str2, $str3 ) {
	if ( 1 === $num ) {
		echo $num . ' ' . $str1;
	} elseif ( 2 <= $num && $num <= 4 ) {
		echo $num . ' ' . $str2;
	} else {
		echo $num . ' ' . $str3;
	}
}

nz_todo2( 2, 'яблоко', 'яблока', 'яблок' );
?>

<!-- 3 -->
<h2>3. Найдите все счастливые билеты. Счастливый билет - это билет,
в котором сумма первых трех цифр его номера равна сумме вторых трех цифр его номера. </h2>
<?php
function nz_todo1() {
	for ( $i = 100000; $i < 110000; $i++ ) {
		if ( sum_arrays( mb_substr( $i, 0, 3 ) ) === sum_arrays( mb_substr( $i, 3, 5 ) ) ) {
			echo $i . ' ';
		}
	}
}

function sum_arrays( $num ) {
	return array_sum( str_split( $num ) );
}

nz_todo1();
?>

<!-- 4 -->
<h2>4. найдите все пары дружественных чисел в промежутке от 1 до 10000. 
Для этого сделайте вспомогательную функцию, которая находит все делители числа и возвращает их в виде массива. 
Также сделайте функцию, которая параметром принимает массив, а возвращает его сумму. </h2>
<?php
function delNumber( $num1 ) {
	$del      = 0;
	$array    = array();
	while ( $del < abs( $num1 ) ) {
		$del++;
		if ( ( $num1 % $del ) == 0 ) {
			$array[] = $del;
		}
	}

	return $array;
}


function sumArray( $array ) {
	$sum = 0;
	foreach ( $array as $value ) {
		$sum += $value; }
	return $sum;
}

function findFriendlyArray( $num ) {
	for ( $i = 0; $i < $num; $i++ ) {
		for ( $j = 0; $j < $num; $j++ ) {
			if ( sumArray( delNumber( $j ) ) == sumArray( delNumber( $i ) ) ) {
				echo $i . ' и ' . $j . '<br>';
			}
		}
	}
}

	findFriendlyArray( 100 );
?>
